# Managed by chezmoi (source: dot_Brewfile.tmpl).
# Apply with: brew bundle --global
# Casks / VS Code extensions / cocoapods are macOS only.

tap "atlassian/acli"
tap "databricks/tap"

# CLI tools (cross-platform)
brew "azure-cli"
brew "deck"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "hk"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libomp"
brew "mise"
brew "node"
brew "osmium-tool"
brew "pandoc"
brew "podman"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "tree"
brew "watchman"
brew "yazi"
brew "zoxide"

# Installed via other managers
npm "@aikidosec/safe-chain"
npm "@openai/codex"
npm "corepack"

{{ if eq .chezmoi.os "darwin" -}}
# macOS only
brew "cocoapods"
cask "alt-tab"
cask "font-symbols-only-nerd-font"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cweijan.vscode-typora"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "magicstack.magicpython"
vscode "marimo-team.vscode-marimo"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
{{ end -}}
